kAMDSuccess = "오류가 발생하지 않았습니다.";
kAMDUndefinedError = "알 수 없는 오류가 발생했습니다.";
kAMDBadHeaderError = "파일을 전송할 수 없습니다.";
kAMDNoResourcesError = "리소스를 할당할 수 없습니다.";
kAMDReadError = "장비에서 읽을 수 없습니다.";
kAMDWriteError = "장비에 기록할 수 없습니다.";
kAMDUnknownPacketError = "알 수 없는 패킷입니다.";
kAMDInvalidArgumentError = "변수가 유효하지 않습니다.";
kAMDNotFoundError = "파일을 찾을 수 없습니다.";
kAMDIsDirectoryError = "경로가 디렉토리입니다.";
kAMDPermissionError = "사용 권한이 없습니다.";
kAMDNotConnectedError = "장비에 연결되지 않았습니다.";
kAMDTimeOutError = "작업 시간이 초과되었습니다.";
kAMDOverrunError = "버퍼 오버런이 발생했습니다.";
kAMDEOFError = "파일의 끝.";
kAMDUnsupportedError = "이 작업이 지원되지 않습니다.";
kAMDFileExistsError = "파일이 이미 존재합니다.";
kAMDBusyError = "장비를 사용 중입니다.";
kAMDCryptoError = "장비에 보안 연결할 수 없습니다.";
kAMDTooBigError = "메시지가 너무 큽니다.";
kAMDInvalidResponseError = "장비에서 예기치 않은 응답을 수신하였습니다.";
kAMDMissingKeyError = "키가 유실되었습니다.";
kAMDMissingValueError = "값이 유실되었습니다.";
kAMDGetProhibitedError = "암호로 잠겨있는 장비에서는 값을 검색할 수 없습니다.";
kAMDSetProhibitedError = "장비 상의 값을 설정할 수 없습니다.";
kAMDRemoveProhibitedError = "장비 상의 값을 제거할 수 없습니다.";
kAMDImmutableValueError = "이 값을 변경할 수 없습니다.";
kAMDPasswordProtectedError = "장비가 암호로 보호되어 있습니다.";
kAMDMissingHostIDError = "장비가 이 호스트를 인식하지 않습니다.";
kAMDInvalidHostIDError = "장비가 이 호스트를 인식하지 않습니다.";
kAMDSessionActiveError = "세션이 활성 상태입니다.";
kAMDSessionInactiveError = "세션이 비활성 상태입니다.";
kAMDMissingSessionIDError = "세션 ID가 유실되었습니다.";
kAMDInvalidSessionIDError = "세션 ID가 유효하지 않습니다.";
kAMDMissingServiceError = "서비스가 유실되었습니다.";
kAMDInvalidServiceError = "서비스가 유효하지 않습니다.";
kAMDServiceLimitError = "이 서비스가 이미 여러 개 실행 중입니다.";
kAMDCheckinSetupFailedError = "장비에서 서비스를 시작할 수 없음";
kAMDInvalidCheckinError = "장비에서 서비스를 시작할 수 없음";
kAMDCheckinTimeoutError = "장비에서 서비스가 올바르게 시작되지 않았습니다.";
kAMDCheckinConnectionFailedError = "장비에서 서비스가 올바르게 시작되지 않았습니다.";
kAMDCheckinReceiveFailedError = "장비에서 서비스가 올바르게 시작되지 않았습니다.";
kAMDCheckinResponseFailedError = "장비에서 서비스가 올바르게 시작되지 않았습니다.";
kAMDCheckinOutOfMemoryError = "장비에서 서비스가 올바르게 시작되지 않았습니다.";
kAMDCheckinSendFailedError = "장비에서 서비스가 올바르게 시작되지 않았습니다.";
kAMDMissingPairRecordError = "호스트가 장비와 쌍으로 연결되어 있지 않습니다.";
kAMDInvalidPairRecordError = "호스트가 더 이상 장비와 쌍으로 연결되어 있지 않습니다.";
kAMDSavePairRecordFailedError = "쌍으로 연결한 기록을 저장할 수 없습니다.";
kAMDInvalidActivationRecordError = "네트워크 연결 기록이 유효하지 않습니다.";
kAMDMissingActivationRecordError = "네트워크 연결 기록을 찾을 수 없습니다.";
kAMDServiceProhibitedError = "장비에서 서비스를 시작할 수 없습니다.";
kAMDEscrowLockedError = "먼저 시동하고 잠금 해제하기 전까지는 장비를 사용할 수 없습니다.";
kAMDProhibitedBySupervision = "감독을 받고 있는 장비에서 금지된 작업입니다.";
kAMDPairingProhibitedError = "오직 USB를 통해서 쌍으로 연결이 허용됩니다.";
kAMDWrongDroidError = "장비가 복구 모드입니다.";
kAMDSUVerificationError = "소프트웨어 업데이트 패키지를 확인할 수 없습니다.";
kAMDSUPatchError = "파일을 패치할 수 없습니다.";
kAMDSUFirmwareError = "펌웨어를 업데이트할 수 없습니다.";
kAMDProvisioningProfileNotValid = "권한 설정 프로파일이 유효하지 않습니다.";
kAMDSendMessageError = "메시지를 장비로 전송할 수 없습니다.";
kAMDReceiveMessageError = "장비에서 메시지를 수신할 수 없습니다.";
kAMDMissingOptionsError = "선택사항이 유실되었습니다.";
kAMDMissingImageTypeError = "이미지가 유실되었습니다.";
kAMDDigestFailedError = "디스크 이미지를 읽을 수 없습니다.";
kAMDStartServiceError = "서비스를 시작할 수 없습니다.";
kAMDInvalidDiskImageError = "디스크 이미지가 유효하지 않습니다.";
kAMDMissingDigestError = "다이제스트가 유실되었습니다.";
kAMDMuxError = "USB 장비 멀티플렉서에 오류가 발생했습니다.";
kAMDApplicationAlreadyInstalledError = "주어진 번들 식별자가 있는 시스템 응용 프로그램이 이미 장비에 설치되어 있으며 대치할 수 없습니다.";
kAMDApplicationMoveFailedError = "응용 프로그램을 해당 장비상의 위치로 이동할 수 없습니다.";
//kAMDApplicationSINFCaptureFailedError = "";
kAMDApplicationSandboxFailedError = "해당 응용 프로그램을 샌드 박스할 수 없습니다.";
kAMDApplicationVerificationFailedError = "해당 응용 프로그램을 확인할 수 없습니다.";
kAMDArchiveDestructionFailedError = "해당 응용 프로그램 아카이브를 제거할 수 없습니다.";
kAMDBundleVerificationFailedError = "네트워크 사업자 번들을 확인할 수 없습니다.";
kAMDCarrierBundleCopyFailedError = "네트워크 사업자 번들을 설치할 수 없습니다.";
kAMDCarrierBundleDirectoryCreationFailedError = "네트워크 사업자 번들 디렉토리를 생성할 수 없습니다.";
kAMDCarrierBundleMissingSupportedSIMsError = "이 네트워크 사업자 번들에 대해 지원되는 SIM이 없습니다.";
kAMDCommCenterNotificationFailedError = "베이스밴드에서 알림을 청취할 수 없습니다.";
kAMDContainerCreationFailedError = "응용 프로그램 컨테이너를 생성할 수 없습니다.";
kAMDContainerP0wnFailedError = "응용 프로그램 컨테이너에 대한 사용 권한을 복구할 수 없습니다.";
kAMDContainerRemovalFailedError = "응용 프로그램 컨테이너를 제거할 수 없습니다.";
kAMDEmbeddedProfileInstallFailedError = "내장 권한 설정 프로파일을 설치할 수 없습니다.";
kAMDErrorError = "오류가 발생했습니다.";
kAMDExecutableTwiddleFailedError = "해당 응용 프로그램에 대한 실행 권한을 변경할 수 없습니다.";
kAMDExistenceCheckFailedError = "해당 응용 프로그램이 이미 존재하는지 확인할 수 없습니다.";
kAMDInstallMapUpdateFailedError = "설치된 응용 프로그램 목록을 업데이트할 수 없습니다.";
kAMDManifestCaptureFailedError = "해당 응용 프로그램 매니페스트를 저장할 수 없습니다.";
kAMDMapGenerationFailedError = "맵을 생성할 수 없습니다.";
kAMDMissingBundleExecutableError = "해당 응용 프로그램 번들에 실행자가 포함되어 있지 않습니다.";
kAMDMissingBundleIdentifierError = "해당 응용 프로그램 번들에 유효한 식별자가 포함되어 있지 않습니다.";
kAMDMissingBundlePathError = "응용 프로그램 번들 경로를 결정할 수 없습니다.";
kAMDMissingContainerError = "설치된 응용 프로그램에 대한 컨테이너를 찾을 수 없습니다.";
kAMDNotificationFailedError = "알릴 수 없습니다.";
kAMDPackageExtractionFailedError = "해당 응용 프로그램 패키지를 열 수 없습니다.";
kAMDPackageInspectionFailedError = "해당 응용 프로그램 패키지를 검사할 수 없습니다.";
kAMDPackageMoveFailedError = "해당 응용 프로그램 패키지를 스테이징 위치로 이동할 수 없습니다.";
kAMDPathConversionFailedError = "경로를 변환할 할 수 없습니다.";
kAMDRestoreContainerFailedError = "응용 프로그램 컨테이너를 복원할 수 없습니다.";
kAMDSeatbeltProfileRemovalFailedError = "해당 응용 프로그램 시트벨트 프로파일을 제거할 수 없습니다.";
kAMDStageCreationFailedError = "스테이징 디렉토리를 생성할 수 없습니다.";
kAMDSymlinkFailedError = "심볼릭 링크(symlink)를 생성할 수 없습니다.";
kAMDiTunesArtworkCaptureFailedError = "iTunes 앨범 사진을 저장할 수 없습니다.";
kAMDiTunesMetadataCaptureFailedError = "iTunes 메타 데이터를 저장할 수 없습니다.";
kAMDAlreadyArchivedError = "해당 응용 프로그램을 이미 아카이브하였습니다.";
kAMDUnknownCommandError = "장비가 해당 명령을 인식하지 않습니다.";
kAMDAPIInternalError = "내부 API 오류가 발생했습니다.";
kAMDMuxCreateListenerError = "USB 장비를 청취할 수 없습니다.";
kAMDMuxGetListenerError = "USB 수신기를 가져올 수 없습니다.";
kAMDMuxConnectError = "장비에 연결할 수 없습니다.";
kAMDDeviceTooNewError = "이 응용 프로그램을 업데이트해야 합니다.";
kAMDDeviceRefNoGood = "이 장비는 더 이상 연결된 상태가 아닙니다.";
kAMDDeviceDisconnectedError = "이 장비는 더 이상 연결된 상태가 아닙니다.";
kAMDCannotTranslateError = "장비에서 보낸 메시지를 변환할 수 없습니다";
kAMDMobileImageMounterMissingImageSignature = "개발을 지원할 수 없습니다.";
kAMDMobileImageMounterResponseCreationFailed = "개발을 지원할 수 없습니다.";
kAMDMobileImageMounterMissingImageType = "개발을 지원할 수 없습니다.";
kAMDMobileImageMounterMissingImagePath = "개발을 지원할 수 없습니다.";
kAMDMobileImageMounterImageMapLoadFailed = "개발을 지원할 수 없습니다.";
kAMDMobileImageMounterAlreadyMounted = "개발을 지원할 수 없습니다.";
kAMDMobileImageMounterImageMoveFailed = "개발을 지원할 수 없습니다.";
kAMDMobileImageMounterMountPathMissing = "개발을 지원할 수 없습니다.";
kAMDMobileImageMounterMountPathNotEmpty = "개발을 지원할 수 없습니다.";
kAMDMobileImageMounterImageMountFailed = "개발을 지원할 수 없습니다.";
kAMDMobileImageMounterTrustCacheLoadFailed = "개발을 지원할 수 없습니다.";
kAMDMobileImageMounterDigestFailed = "개발을 지원할 수 없습니다.";
kAMDMobileImageMounterDigestCreationFailed = "개발을 지원할 수 없습니다.";
kAMDMobileImageMounterImageVerificationFailed = "개발을 지원할 수 없습니다.";
kAMDMobileImageMounterImageInfoCreationFailed = "개발을 지원할 수 없습니다.";
kAMDMobileImageMounterImageMapStoreFailed = "개발을 지원할 수 없습니다.";
kAMDDeviceOSVersionTooLow = "장비 OS 버전이 너무 낮습니다.";
kAMDNoWifiSyncSupportError = "장비에서 무선 동기화를 지원하지 않습니다.";
kAMDDeviceFamilyNotSupported = "이 응용 프로그램은 이런 종류의 장비를 지원하지 않습니다.";
kAMDPackagePatchFailedError = "응용 프로그램에 패치 업데이트를 적용할 수 없습니다.";
kAMDIncorrectArchitectureError = "이 응용 프로그램은 이 장비의 CPU 유형을 지원합니다.";
kAMDPluginCopyFailedError = "응용 프로그램 컨테이너에 VPN 플러그인을 복사할 수 없습니다.";
kAMDBreadcrumbFailedError = "설치 브레드 크럼을 쓸 수 없습니다.";
kAMDBreadcrumbUnlockError = "설치 브레드 크럼을 업데이트할 수 없습니다.";
kAMDGeoJSONCaptureFailedError = "GeoJSON 데이터를 저장할 수 없습니다.";
kAMDNewsstandArtworkCaptureFailedError = "뉴스 가판대 앨범 사진을 저장할 수 없습니다.";
kAMDMissingCommandError = "해당 요청에 명령이 포함되어 있지 않습니다.";
kAMDNotEntitledError = "요청한 응용 프로그램은 이 요청을 하도록 허용되지 않습니다.";
kAMDMissingPackagePathError = "요청에 패키지 경로가 없습니다.";
kAMDMissingContainerPathError = "요청에 컨테이너 경로가 없습니다.";
kAMDMissingApplicationIdentifierError = "요청에 응용 프로그램 식별자가 없습니다.";
kAMDMissingAttributeValueError = "요청에 필수 값이 없습니다.";
kAMDLookupFailedError = "설치된 응용 프로그램 목록을 표시할 수 없습니다.";
kAMDDictCreationFailedError = "요청에서 기능을 추출할 수 없습니다.";

/* kMISFileError */
"A file operation failed." = "파일 작업이 실패했습니다.";

/* kMISModifiedResourcesError */
"A signed resource has been added, modified, or deleted." = "서명된 리소스가 추가, 수정, 또는 삭제되었습니다.";

/* kMISInvalidSignerError */
"A valid provisioning profile for this executable was not found." = "이 실행 파일에 대해 유효한 권한 설정 프로파일을 발견하지 못 했습니다.";

/* kMISUnknownError */
"An unknown error has occurred." = "알 수 없는 오류가 발생했습니다.";

/* kMISNotMutableError */
"Attempted to modify an immutable provisioning profile." = "변경할 수 없는 권한 설정 프로파일을 수정하려고 시도했습니다.";

/* kMISApplicationSignatureNotValidError */
"The application does not have a valid signature." = "이 응용 프로그램에는 유효한 서명이 없습니다.";

/* kMISApplicationSignatureNotValidError */
"The application's signature is valid but it does not match the expected hash." = "응용 프로그램의 서명이 유효하지만 예상한 해시와 일치하지 않습니다.";

/* kMISAdHocSignatureError */
"The executable contains an invalid signature." = "이 실행 파일은 유효하지 않은 서명을 포함하고 있습니다.";

/* kMISInvalidEntitlementError */
"The executable was signed with invalid entitlements." = "이 실행 파일은 유효하지 않은 인타이틀먼트로 서명되었습니다.";

/* kMISInvalidSignerCertError */
"The identity used to sign the executable is no longer valid." = "실행 파일에 서명할 때 사용한 신원이 더 이상 유효하지 않습니다.";

/* kMISSignatureNotValidError */
"The signature was not valid." = "서명이 유효하지 않습니다.";

/* kMISConnectionClosedError */
"There was an error communicating with your device." = "장비와 통신하는 중 오류가 발생했습니다.";

/* kMISUnsupportedDeviceError */
"This provisioning profile cannot be installed on this device." = "이 권한 설정 프로파일은 이 장비에 설치될 수 없습니다.";

/* kMISProfileSignatureNotValidError */
"This provisioning profile does not have a valid signature (or it has a valid, but untrusted signature)." = "이 권한 설정 프로파일은 유효한 서명이 없습니다 (또는 유효하지만, 신뢰할 수 없는 서명을 갖고 있습니다).";

/* kMISExpiredError */
"This provisioning profile has expired." = "이 권한 설정 프로파일은 만료되었습니다.";

/* kMISMalformedProfileError */
"This provisioning profile is malformed." = "이 권한 설정 프로파일은 잘못 만들어졌습니다.";

/* kMISUnsupportedVersionError */
"This provisioning profile is unsupported." = "이 권한 설정 프로파일은 지원되지 않습니다.";

/* kMISAllocationError */
"Unable to allocate memory." = "메모리를 할당할 수 없습니다.";

